# -*- coding: utf-8 -*-
"""
Created on Thu Apr 21 14:48:30 2016

@author: sunwhale
"""

DictGoodsType={
"":"原始文件未列出",\
" 板材":"板材",\
" 刺猬紫檀木方料":"锯材",\
" 木制餐椅":"家具",\
" 木制茶几":"家具",\
" 木制橱柜":"家具",\
" 木制床":"家具",\
" 木制花架":"家具",\
" 木制梳妆台":"家具",\
" 木制小凳":"家具",\
" 木制写字台":"家具",\
" 托盘":"木制品",\
" 原木":"原木",\
" 装软垫木制沙发":"家具",\
"Sawn Wood":"锯材",\
"吧椅":"家具",\
"摆件":"木制品",\
"板材":"板材",\
"边几":"家具",\
"餐厅家具":"家具",\
"餐碗":"木制品",\
"餐桌":"家具",\
"茶几":"家具",\
"长凳":"家具",\
"床":"家具",\
"床靠背":"家具",\
"床头柜":"家具",\
"床尾凳":"家具",\
"刺猬紫檀木方料":"木方",\
"粗锯枋":"锯材",\
"粗木枋":"锯材",\
"大鼓":"木制品",\
"单板":"板材",\
"单人沙发":"家具",\
"凳子":"家具",\
"地板":"地板",\
"电视柜":"家具",\
"雕刻":"木制品",\
"短原木":"原木",\
"耳环":"木制品",\
"方料":"锯材",\
"方木":"锯材",\
"粉":"粉",\
"粉末和颗粒":"粉",\
"根":"根、枝和碎木",\
"根、枝和碎木":"根、枝和碎木",\
"根，枝和碎木":"根、枝和碎木",\
"工艺品":"木制品",\
"柜子":"家具",\
"国际象棋":"木制品",\
"活体":"活体",\
"家具":"家具",\
"家具(椅子)":"家具",\
"家具(桌子、柜子、茶几)":"家具",\
"家具（床）":"家具",\
"家具（床头柜）":"家具",\
"家具（凳子）":"家具",\
"家具及雕刻品":"家具",\
"脚踏":"家具",\
"角几":"家具",\
"锯材":"锯材",\
"锯材和碎木":"锯材",\
"块、片":"碎木",\
"铭牌":"木制品",\
"木板材":"板材",\
"木材":"原木",\
"木橱":"家具",\
"木地板":"地板",\
"木雕":"木制品",\
"木雕挂件":"木制品",\
"木方":"锯材",\
"木棍":"木制品",\
"木花盆":"木制品",\
"木块":"碎木",\
"木皮":"树皮",\
"木片":"碎木",\
"木条":"碎木",\
"木椅":"家具",\
"木制壁炉架":"家具",\
"木制餐台":"家具",\
"木制餐椅":"家具",\
"木制茶几":"家具",\
"木制橱柜":"家具",\
"木制床":"家具",\
"木制床边柜":"家具",\
"木制床前凳":"家具",\
"木制电视柜":"家具",\
"木制多斗柜":"家具",\
"木制花架":"家具",\
"木制家具":"家具",\
"木制家具(电视柜)":"家具",\
"木制家具(酒柜)":"家具",\
"木制家具(沙发)":"家具",\
"木制家具(书柜)":"家具",\
"木制家具(衣架)":"家具",\
"木制家具(椅子)":"家具",\
"木制家具(桌子)":"家具",\
"木制品":"木制品",\
"木制屏风":"家具",\
"木制沙发":"家具",\
"木制梳妆凳":"家具",\
"木制梳妆台":"家具",\
"木制书橱":"家具",\
"木制小凳":"家具",\
"木制小书架":"家具",\
"木制鞋柜":"家具",\
"木制写字台":"家具",\
"木制写字桌":"家具",\
"木制休闲椅":"家具",\
"木制玄关台":"家具",\
"木制摇椅":"家具",\
"木制衣橱":"家具",\
"木制衣架":"家具",\
"木制圆凳":"家具",\
"木制装饰橱":"家具",\
"木制装饰柜":"家具",\
"木制装饰品":"木制品",\
"木制桌子":"家具",\
"木珠":"木制品",\
"盘":"木制品",\
"刨光材":"锯材",\
"沙发":"家具",\
"十去乙酰基巴卡丁三":"未知",\
"饰面用单板":"板材",\
"手推车":"木制品",\
"书桌":"家具",\
"树干、树根和树枝":"根、枝和碎木",\
"树节":"碎木",\
"树皮":"树皮",\
"树桩":"根、枝和碎木",\
"双人沙发":"家具",\
"碎片":"碎木",\
"提取物":"提取物",\
"托盘":"木制品",\
"文物":"木制品",\
"卧室家具":"家具",\
"项链":"木制品",\
"象棋":"木制品",\
"玄关桌":"家具",\
"衣箱":"家具",\
"椅子":"家具",\
"油":"油",\
"原木":"原木",\
"原木　":"原木",\
"原木、锯材和碎木":"原木和锯材",\
"原木段":"原木",\
"原木和粗木枋":"原木和锯材",\
"原木和锯材":"原木和锯材",\
"园艺家具（凳子）":"家具",\
"园艺家具（桌子）":"家具",\
"展示架":"家具",\
"折扇":"木制品",\
"种苗":"种苗",\
"烛台":"木制品",\
"装软垫木制沙发":"家具",\
"桌面":"板材",\
"桌子":"家具",\
"BENCH":"家具",\
"吧台桌":"家具",\
"板材  ":"板材",\
"板材/倒角板材":"板材",\
"板材/地板条":"板材",\
"背几":"家具",\
"边柜":"家具",\
"标签":"木制品",\
"宠物床":"家具",\
"橱柜":"家具",\
"储物":"家具",\
"储物柜":"家具",\
"床头靠背板":"家具",\
"床用框架":"家具",\
"粗锯枋 ":"锯材",\
"灯台":"家具",\
"地板板条":"地板",\
"雕刻品":"木制品",\
"多层地板":"地板",\
"工艺品马车":"木制品",\
"柜子 ":"家具",\
"盒":"木制品",\
"盒子":"木制品",\
"花瓶":"木制品",\
"画框":"木制品",\
"家具(床头柜、梳妆台）":"家具",\
"家具(书柜、茶几）":"家具",\
"家具（椅子）":"家具",\
"家具（桌子、柜子）":"家具",\
"胶合板":"板材",\
"镜框":"木制品",\
"酒桶架":"木制品",\
"旧矮柜":"家具",\
"旧壁橱":"家具",\
"旧茶几":"家具",\
"旧花架":"家具",\
"旧化妆台":"家具",\
"旧屏风":"家具",\
"旧四方柜":"家具",\
"旧文书盒":"家具",\
"旧椅子":"家具",\
"旧展柜":"家具",\
"旧装饰柜":"家具",\
"旧桌子":"家具",\
"锯木板材":"板材",\
"乐器":"木制品",\
"落地灯":"家具",\
"木雕件":"木制品",\
"木雕小件":"木制品",\
"木雕装饰件（大）":"木制品",\
"木雕装饰件（小）":"木制品",\
"木制餐边柜":"家具",\
"木制餐车":"木制品",\
"木制茶水柜":"家具",\
"木制抽屉柜":"家具",\
"木制雕花小件":"木制品",\
"木制挂件":"木制品",\
"木制花台":"家具",\
"木制化妆凳":"家具",\
"木制镜框":"木制品",\
"木制酒柜":"家具",\
"木制木雕件":"木制品",\
"木制书报架":"家具",\
"木制书柜":"家具",\
"木制书架":"家具",\
"木制推餐车":"木制品",\
"木制西装衣架":"家具",\
"木制象桶凳":"家具",\
"木制写字椅":"家具",\
"木制休闲沙发":"家具",\
"木制衣柜":"家具",\
"木制椅子":"家具",\
"木制镇酒架":"家具",\
"木桌":"家具",\
"屏风":"家具",\
"棋类套装":"木制品",\
"沙发 ":"家具",\
"沙发背几":"家具",\
"梳妆凳":"家具",\
"梳妆台":"家具",\
"书柜":"家具",\
"书架":"家具",\
"四面刨平板材":"板材",\
"四面刨平地板":"地板",\
"小凳":"家具",\
"玄关柜":"家具",\
"衣架":"家具",\
"椅子  ":"家具",\
"艺品架":"家具",\
"原木   ":"原木",\
"原木(粗锯成方)":"原木",\
"原木（粗锯成方）":"原木",\
"原木（粗锯方材）":"原木",\
"圆餐桌":"家具",\
"烛台座":"家具",\
"装饰橱":"家具",\
"装饰镜":"家具",\
"桌子 ":"家具",\
"紫杉醇":"药物",\
"柞木板材":"板材",\
"片":"片",\
"着色料":"着色料",\
"琴弓":"木制品",\
"弦乐器":"木制品",\
"枝叶":"枝叶",\
"注射剂":"药物",\
}
