# -*- coding: utf-8 -*-
"""
Created on Thu Apr 21 14:48:30 2016

@author: sunwhale
"""

DictUnit={
"":"原始文件未列出",\
"Set":"套",\
'KG':"千克",\
"Kg":"千克",\
"g":"克",\
"Cu.m":"立方米",\
"Pcs":"件",\
"株":"株",\
"Sq.m":"平方米",\
"Pc":"件",\
"Capsule":"小盒、容器、胶囊",\
"Pair":"双、对",\
"kg":"千克",\
"Ctn":"箱",\
"件":"件",\
"立方米":"立方米",\
"Bottle":"瓶",\
}

DictOrigin={
"":"原始文件未列出",\
"\"F, W\"":"F,W",\
"\"O, W\"":"O,W",\
"\"O,W\"":"O,W",\
"\"O,U\"":"O,U",\
"A":"A",\
"I":"I",\
"O":"O",\
"U":"U",\
"W":"W",\
"C":"C",\
"D":"D",\
}